[
    {
        "0": "Toasted Tomato-Paneer Sandwiches",
        "1": "https://assets.epicurious.com/photos/61e1e6a267a96f29d95fc231/1:1/w_2560%2Cc_limit/TomatoPaneerSandwich_RECIPE_012322_26158.jpg",
        "2": "3 Tbsp. extra-virgin olive oil2 (6-oz.) packages paneer1 medium onion, finely chopped6 garlic cloves, finely chopped½ jalapeño, seeds removed, finely chopped1 (1\") piece ginger, peeled, finely chopped1 tsp. cumin seeds½ tsp. mustard seeds2 tsp. ground coriander½ tsp. cayenne pepper½ tsp. ground turmeric1 (15-oz.) can crushed tomatoes2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt12 bread slices1 small red onion, thinly sliced1½ cups coarsely grated sharp cheddar or low-moisture mozzarella½ cup chopped cilantro3 Tbsp. unsalted butterKetchup (for serving)",
        "3": "Heat oil in a large Dutch oven or other heavy pot over medium. Cook paneer in a single layer, undisturbed, until golden brown underneath, about 2 minutes. Turn over and cook on other side until golden brown, about 2 minutes. Transfer to a medium bowl; let cool slightly, then crumble into bite-size pieces. Set aside.Add onion, garlic, jalapeño, ginger, cumin seeds, and mustard seeds to same pot and cook (still over medium), stirring often, until onion is softened and translucent, about 5 minutes. Add coriander, cayenne, and turmeric and cook, stirring occasionally, until fragrant, about 3 minutes. Stir in tomatoes, salt, and 1 cup water. Bring to a simmer, then reduce heat to low and stir in reserved paneer. Cover pot and cook, stirring occasionally, until sauce is slightly thickened, 15–20 minutes.Spread a slice of bread with ½ cup sauce. Top with some of the red onion, cheddar, and cilantro (about a sixth of each); close up sandwich with another slice of bread. Repeat with remaining ingredients to make 5 more sandwiches.Melt 1 Tbsp. butter in a small nonstick skillet over medium. Cook 2 sandwiches, pressing down occasionally on them with a spatula to ensure good contact with the pan, until underside is golden brown and crisp, about 3 minutes. Turn sandwiches over and cook until other side is golden brown and cheese is melted, about 3 minutes. Transfer to a plate. Repeat process two more times with remaining butter and sandwiches.Slice sandwiches in half and serve with ketchup.",
        "4": "https://www.epicurious.com/recipes/food/views/toasted-tomato-paneer-sandwiches"
    },
    {
        "0": "Oven-Dried-Tomato Stecca",
        "1": "https://assets.epicurious.com/photos/6124fc003f217343a69768bf/1:1/w_2560%2Cc_limit/tomato_stecca_mastering-bread-082421.jpg",
        "2": "1 pound fresh tomatoes, any kind138 g (1⅛ cups) bolted hard wheat flour (100%)138 g (½ cup) water (100%)0.19 g (1/16 teaspoon) dry yeast (0.14%)Total: 276.19 g (200.14%)413 g (3½ cups) bolted hard wheat flour (100%)165 g (1 cup) tomato guts, reserved from above (40%)103 g (½ cup) water (25%)25 g (1 ¾ Tablespoons) extra-virgin olive oil (6%)0.66 g (¼ teaspoon) dry yeast (0.16%)276.19 g (1⅓ cups) poolish, from above (67%)11 g (1¾ teaspoons) salt (2.7%)206 g (1⅛ cups) oven-dried tomatoes, from above (50%)Total: 1,199.85 g (290.86%)",
        "3": "Dry tomatoes: If your tomatoes are medium or large, cut away the stem, cut them in half, and scoop or squeeze out the juice and seeds, reserving the tomato guts for the dough. Then cut the tomatoes into bite-size pieces about ¼-inch thick. If you are using cherry tomatoes, you can just nick them to squeeze out the guts, then cut them in half. Drying is easiest with a dehydrator. If you have one, set it to medium (about 150°F) and dehydrate the tomatoes for several hours until semi-dry but still flexible. Or place the tomatoes on wire racks in an oven set as low as it goes and dry for several hours. You could also go old school and place the tomatoes on a wire rack, cover them with cheesecloth, then allow them to air-dry outside on a warm, sunny day or in a sunny window until ready to use. This method will take several days. You don’t want them leathery like fully dehydrated tomatoes, just more concentrated and less watery than fresh tomatoes.Mix dough: Weigh the flour and the remaining ingredients, including the tomato guts. If you’re short on tomato guts, make up the difference with water. We’ll be mixing by hand, so everything will go into a mixing bowl.Combine the tomato guts, water, oil, yeast, poolish, and flour in a large mixing bowl. Mix with a spoon, dough scraper, or your hands, scraping the bottom of the bowl to hydrate all the flour. Keep mixing by stirring, folding, and breaking up the dough for another 3 minutes. Cover with a tea towel and let rest for 15 minutes. Then add the salt and repeat mixing (breaking up and folding the dough) for 3 minutes. Cover and let rest for 15 minutes. Then add the oven-dried tomatoes and mix again for 3 minutes. Finally, cover the bowl and let the dough rest at room temperature for 1 hour. Then transfer the dough to a lightly oiled container with a lid and room for the dough to double in volume. Put on the lid and refrigerate for 30 minutes.Do a four-fold: Think of the dough as having a middle and four sides. If the dough is sticky, wet your hand to prevent sticking, then make your hand like a paddle (or just use a dough scraper) and dig it down one side of the container. Scoop up the dough, stretching just a little to create some tension. Then flop that section onto the center of the dough.Give the container a quarter turn and repeat the stretch-and-fold action. Repeat until all four sides are folded. The dough should now appear less slack and have some more height. (At this point, we like to flip the dough over, so the folds are on the bottom and the smooth side is on top. This helps to hold more tension in the bulk shape, a good thing for overall structure.)Return the container to the fridge for 8 to 24 hours. On the short end of that range, the dough will be bubbly and well risen, and on the long end, it may be more wobbly and on the brink of collapse. Try not to let it go too long.Shape: Pull the dough from the fridge. At this point, it should be very bubbly and inflated. Place a large baking stone on a rack, preferably near the top of the oven. Preheat the oven to 400°F. Have a couche, sheet pan or large cutting board, and a bench knife ready. Dust a section of countertop liberally with flour and turn the dough out onto it. Dust the top of the dough with more flour. This is a sticky dough, so be prepared to handle it lightly. Coax the dough from an oval into a loose rectangle, then divide the dough in half, bisecting the long sides. Divide each piece again to make four strips of dough, about 3 by 10 inches. Dust all the cut edges with flour. Roll each strip over once to ensure it is evenly coated with flour, then gently lift it onto the couche. Leave about an inch of fabric between each strip, lifting the fabric so that each strip of dough supports the other with folds of fabric between them. Cover with a tea towel and leave to rest for 30 to 45 minutes.Assemble your toppings, in this case, the olive oil and salt. Cut a sheet of parchment paper that will fit over the back side of a half sheet pan to use as a peel, then gently transfer two of the loaves to the parchment. If the dough has been very active, put the remaining two loaves in the fridge to slow the fermentation down a bit. Dock the stecca all over by poking your fingers down into the dough, almost all the way through. As the bread rises in the oven, it will push the indentations up, sometimes squeezing them out entirely, so you want nice, deep dimples. Drizzle the stecca with the oil, then sprinkle with the salt from high up for even distribution.Bake: Load the stecca into the oven by sliding the parchment paper onto the stone. Bake for 12 minutes. Rotate the loaves as necessary for even browning, then bake for an additional 5 minutes. When done, the crust color should be medium tan. Pull the stecca out and transfer to a rack to cool. Give the oven 5 minutes to rebound, then begin assembling your second round to bake.Stecca are great fresh, but they’ll keep all right for a few days in a bag or box at room temperature. After day one, refresh them in a 350°F oven for a few minutes for the best flavor and texture.",
        "4": "https://www.epicurious.com/recipes/food/views/oven-dried-tomato-stecca-mastering-bread-claire-kopp-mcwilliams"
    },
    {
        "0": "Sonoran-Style Potato, Cheese, and Tomato Soup",
        "1": "https://assets.epicurious.com/photos/61004c276a63b0a3c672e6c6/1:1/w_2560%2Cc_limit/SonoranSoup_RECIPE_072221_19225.jpg",
        "2": "3 Tbsp. extra-virgin olive oil1 medium red onion, finely chopped1–2 poblano or Anaheim chiles, seeds removed, thinly sliced1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more3 large garlic cloves, thinly sliced1 Tbsp. tomato paste1 medium green or yellow summer squash, cut into ½\" pieces1 lb. Yukon Gold potatoes (3–4 large), scrubbed, cut into ½\" pieces6 cups chicken broth (not low-sodium)1 cup cherry tomatoes, halved⅓ cup oregano or marjoram leaves1½ tsp. red wine vinegar½ cup whole milk or half-and-half (optional)10 oz. queso fresco, cut into ½\" pieces",
        "3": "Heat oil in a large Dutch oven or other heavy pot over medium. Cook red onion, chile, and 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, stirring with a wooden spoon, until starting to soften, about 3 minutes. Stir in garlic and tomato paste, breaking up paste so it coats vegetables, then add squash, potatoes, and broth. Increase heat to medium-high and bring broth to a simmer. Reduce heat to medium and cook until potatoes are almost falling apart, 15–20 minutes.Add cherry tomatoes to pot and cook until warmed through but not bursting, about 3 minutes. Stir in oregano and vinegar and simmer 2 minutes to allow flavors to blend. Remove from heat and stir in milk (if using). Taste soup and season with more salt if needed.Divide queso fresco among bowls and ladle soup over, stirring to prevent cheese from clumping.",
        "4": "https://www.epicurious.com/recipes/food/views/sonoran-style-potato-cheese-tomato-soup"
    },
    {
        "0": "Paneer-Stuffed Peppers",
        "1": "https://assets.epicurious.com/photos/61e1e69dca762417d65ec311/1:1/w_2560%2Cc_limit/PaneerStuffedPeppers_RECIPE_012322_26146.jpg",
        "2": "3 Tbsp. extra-virgin olive oil2 (6-oz.) packages paneer1 medium onion, finely chopped6 garlic cloves, finely chopped½ jalapeño, seeds removed, finely chopped1 (1\") piece ginger, peeled, finely chopped1 tsp. cumin seeds½ tsp. mustard seeds2 tsp. ground coriander½ tsp. cayenne pepper½ tsp. ground turmeric1 (15-oz.) can crushed tomatoes2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher saltNonstick vegetable oil spray4 red or yellow bell peppers, halved through stem end, ribs and seeds removedChopped cilantro (for serving)",
        "3": "Heat oil in a large Dutch oven or other heavy pot over medium. Cook paneer in a single layer, undisturbed, until golden brown underneath, about 2 minutes. Turn over and cook on other side until golden brown, about 2 minutes. Transfer to a medium bowl; let cool slightly, then crumble into bite-size pieces. Set aside.Add onion, garlic, jalapeño, ginger, cumin seeds, and mustard seeds to same pot and cook (still over medium), stirring often, until onion is softened and translucent, about 5 minutes. Add coriander, cayenne, and turmeric and cook, stirring occasionally, until fragrant, about 3 minutes. Stir in tomatoes, salt, and 1 cup water. Bring to a simmer, then reduce heat to low and stir in reserved paneer. Cover pot and cook, stirring occasionally, until sauce is slightly thickened, 15–20 minutes.Place a rack in middle of the oven; preheat to 400°. Coat a rimmed baking sheet with nonstick spray. Place peppers, cut side up, on baking sheet. Spoon ⅓ cup sauce into each pepper half. Bake until peppers are tender and top is lightly browned, 25–30 minutes.Transfer stuffed peppers to plates and top with cilantro.",
        "4": "https://www.epicurious.com/recipes/food/views/paneer-stuffed-peppers"
    },
    {
        "0": "Esqueixada de Montaña (Cured Trout with Tomato, Black Olive, and Onion)",
        "1": "https://assets.epicurious.com/photos/60fecf88d2ec312335e99405/1:1/w_2560%2Cc_limit/CuredTrout_sharpening_V1.jpg",
        "2": "1 lemon1½ teaspoon honey½ teaspoon kosher salt¼ cup extra-virgin olive oil2 large super-ripe tomatoes (10 ounces)2 garlic cloves, minced1 large rosemary sprig1 teaspoon kosher salt½ cup extra-virgin olive oil1 pound trout fillets, pin bones removed¼ cup gin8 juniper berries, crushed with the flat side of a knife1 teaspoon black peppercorns, crushed½ cup kosher salt½ cup granulated sugar3 tablespoons Lemon Vinaigrette¼ cup thinly sliced sweet onion¼ cup diced pitted Kalamata olives1 lemon",
        "3": "To make the vinaigrette, zest the lemon into the bowl of a food processor. Trim the top and bottom of the lemon, then cut off the peel and pith. Holding the lemon flesh over the food processor bowl, cut out the segments by slicing between the membranes. Squeeze any juice remaining in the membrane, then squeeze any juice in the peel and pith. Add the honey and salt to the bowl and process. With the machine running, add the oil in a slow, steady stream until emulsified. The vinaigrette can be refrigerated in an airtight container for up to 3 days. Bring to room temperature and shake well before using.Cut the tomatoes in half through their equators.Set a box grater over a large bowl. Grate the cut sides of the tomatoes on the large holes until only the skin remains; discard the skins. Stir in the garlic. Cut the rosemary sprig in half, then bruise the sprigs by gently pounding with the dull edge of a knife and add to the tomato mixture. Whisk in the salt and oil. Cover tightly with plastic wrap and refrigerate overnight for the flavors to meld.Find a container or shallow dish just large enough to hold the fillets snugly in a single layer. Line the container with plastic wrap with overhang on all sides. Place the fillets in the plastic wrap, skin side down.Pour the gin on top. Mix the juniper, pepper- corns, salt, and sugar in a small bowl, then spread over the fillets to evenly coat. Cover with the plastic wrap overhang and then cover the whole container with plastic wrap. Refrigerate for 4 hours.Unwrap the trout, rinse off the cure under cold water, and pat dry. Cut the trout off the skin; discard the skin. Cut the fillets into 1/8-inch-thick slices. Remove the rosemary from the tomatoes and spread the tomatoes on a serving platter.Top with the trout slices. Drizzle the lemon vinaigrette on top, then sprinkle with the onion and olives. Zest the lemon directly on top and serve immediately.",
        "4": "https://www.epicurious.com/recipes/food/views/cured-trout-with-tomato-black-olive-and-onion"
    },
    {
        "0": "Pico de Gallo Norteño (Fresh Tomato Salsa)",
        "1": "https://assets.epicurious.com/photos/60c8fdb00cf185ee0f880881/master/w_160%2Cc_limit/food_from_my_heart_cover_VOG.jpg",
        "2": "2–4 jalapeño or serrano chiles or use more or less to taste, tops trimmed but not seeded1 medium garlic clove4 large, ripe fresh tomatoes, peeled but not seeded (about 2 ½ pounds)6–8 scallions with part of green tops¼ cup (not packed down) fresh cilantro leaves, stripped from stemsJuice of 1 large limeSalt to taste1 teaspoon Mexican oregano, or to taste",
        "3": "With a large sharp knife, chop chiles very fine and reserve. Mince the garlic. Coarsely chop the tomatoes. Finely chop the scallions and cilantro. Place all fresh ingredients except chiles in a large bowl. If tomatoes are very dry and juiceless, gradually add up to ½ cup cold water to give a light salsa consistency. Stir to mix ingredients. Add chiles a little at a time, tasting, until it is as hot as you like. Add 1 teaspoon (or to taste) crumbled oregano. Squeeze lime juice into the salsa; gradually add salt to taste. Use at once.",
        "4": "https://www.epicurious.com/recipes/food/views/pico-de-gallo-norteno-zarela-martinez"
    },
    {
        "0": "Chili Crab Dip With Shrimp Chips",
        "1": "https://assets.epicurious.com/photos/619bb9bd1eebb0da631b17d7/1:1/w_2560%2Cc_limit/ChiliCrabDipShrimpChips_RECIPE_111821_23678.jpg",
        "2": "2 medium shallots, quartered1 lemongrass stalk, bottom third only, tough outer layers removed, cut into a few pieces1 3–4\" piece ginger, peeled, coarsely chopped1 serrano chile, preferably starting to turn orange, halved, seeds removed if desired4 medium garlic cloves2 Tbsp. double-concentrated tomato paste1 tsp. sugar1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, plus more1 Tbsp. vegetable oil4 oz. cream cheese, room temperature2 Tbsp. mayonnaise8 oz. claw crabmeat, picked over3 medium scallions, finely chopped½ large bunch cilantro, tough stems discarded, leaves and tender stems finely chopped2 Tbsp. store-bought fried shallots or garlic (optional)Shrimp chips (such as Dandy’s or Shrimp Snacks) or Ritz crackers (for serving)",
        "3": "Pulse or blend shallots, lemongrass, ginger, chile, garlic, tomato paste, sugar, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ½ cup water in a food processor or blender until a coarse purée forms.Heat oil in a medium skillet over medium-high. Scrape purée into pan and cook, stirring often, until mixture darkens and thickens to the consistency of tomato paste, 12–15 minutes. If it begins to stick and brown, stir in a little water (about 1 Tbsp.), scraping up any browned bits with a wooden spoon. (You should have about ⅔ cup.)Transfer mixture to a small bowl and vigorously mix in cream cheese and mayonnaise. Stir in crabmeat, half of the scallions, and half of the cilantro. Taste dip and season with more salt if needed.Transfer dip to a serving bowl. Top with remaining scallions and cilantro, then with fried shallots (if using). Serve with shrimp chips.",
        "4": "https://www.epicurious.com/recipes/food/views/chili-crab-dip"
    },
    {
        "0": "Turkey Meatloaf",
        "1": "https://assets.epicurious.com/photos/61f4241faf69e17e85831285/1:1/w_2560%2Cc_limit/Meatloaf_RECIPE_20220125_2027_V1_final.jpg",
        "2": "1½ cups finely chopped onion1 tablespoon minced garlic1 teaspoon olive oil1 medium carrot, cut into ⅛-inch dice¾ pound cremini mushrooms, trimmed and very finely chopped in a food processor1 teaspoon salt½ teaspoon black pepper1½ teaspoons Worcestershire sauce⅓ cup finely chopped fresh parsley¼ cup plus 1 tablespoon ketchup1 cup fine fresh bread crumbs (from 2 slices firm white sandwich bread)⅓ cup 1% milk1 whole large egg, lightly beaten1 large egg white, lightly beaten1¼ pound ground turkey (mix of dark and light meat)roasted red pepper tomato sauce or ketchupa meat thermometer or an instant-read thermometer",
        "3": "Preheat oven to 400°F.Cook onion and garlic in oil in a 12-inch nonstick skillet over moderate heat, stirring, until onion is softened, about 2 minutes. Add carrot and cook, stirring, until softened, about 3 minutes. Add mushrooms, ½ teaspoon salt, and ¼ teaspoon pepper and cook, stirring occasionally, until liquid mushrooms give off is evaporated and they are very tender, 10 to 15 minutes. Stir in Worcestershire sauce, parsley, and 3 tablespoons ketchup, then transfer vegetables to a large bowl and cool.Stir together bread crumbs and milk in a small bowl and let stand 5 minutes. Stir in egg and egg white, then add to vegetables. Add turkey and remaining ½ teaspoon salt and ¼ teaspoon pepper to vegetable mixture and mix well with your hands. (Mixture will be very moist.)Form into a 9- by 5-inch oval loaf in a lightly oiled 13- by 9- by 2-inch metal baking pan and brush meatloaf evenly with remaining 2 tablespoons ketchup. Bake in middle of oven until thermometer inserted into meatloaf registers 170°F, 50 to 55 minutes.Let meatloaf stand 5 minutes before serving.",
        "4": "https://www.epicurious.com/recipes/food/views/turkey-meatloaf-107599"
    },
    {
        "0": "Ensalada de Sandía y Tomate (Watermelon Tomato Salad with Goat Cheese and Corn Nuts)",
        "1": "https://assets.epicurious.com/photos/60fee610f6a98c4862339ff5/1:1/w_2560%2Cc_limit/WatermelonTomatoSalad_RECIPE_072221_19368.jpg",
        "2": "1 tablespoon honey1½ tablespoons reserve sherry vinegarKosher salt¼ cup extra-virgin olive oil¼ cup corn nuts, preferably Quicos4 medium heirloom tomatoes, cut into wedges4 cups 1-inch watermelon cubes¼ cup very thinly sliced sweet onion3 ounces goat cheese, such as Capricho de Cabra2 tarragon sprigs",
        "3": "Whisk the honey, vinegar, and ½ teaspoon salt in a small bowl. While whisking, add the oil in a slow, steady stream until emulsified.Pulse the corn nuts in a food processor until finely chopped.Arrange the tomatoes in serving dishes in a single layer and sprinkle with ½ teaspoon salt. Top with the watermelon and onion and drizzle with the dressing. Crumble the goat cheese and pluck the tarragon leaves on top. Sprinkle on the corn nuts and serve immediately.",
        "4": "https://www.epicurious.com/recipes/food/views/watermelon-tomato-salad-with-goat-cheese-and-corn-nuts"
    },
    {
        "0": "Shepherd's Pie",
        "1": "https://assets.epicurious.com/photos/54f89ef34f77a310045dc604/1:1/w_2560%2Cc_limit/240224_shepherds-pie_6x4.jpg",
        "2": "1 tablespoon vegetable oil1 large onion, peeled and chopped1 large carrot, peeled and chopped1 pound ground lamb (or substitute half with another ground meat)1 cup chicken broth1 tablespoon tomato paste1 teaspoon chopped fresh or dry rosemary1 tablespoon chopped Italian parsley1 cup frozen peas2 pounds russet potatoes, peeled and cut into chunks6 tablespoons unsalted butter½ cup milkKosher salt to tasteSpecial equipment: 1½-quart baking dish, potato masher",
        "3": "Preheat oven to 375°F.In a large sauté pan over medium-high heat, heat the oil, then add the onion, carrot, and meat. Cook until browned, 8 to 10 minutes.Drain the fat and add the broth, tomato paste, and herbs. Simmer until the juices thicken, about 10 minutes, then add the peas. Pour the mixture into a 1½-quart baking dish; set aside.Meanwhile, bring the potatoes to a boil in salted water. Cook until tender, about 20 minutes; drain.Mash the potatoes with the butter, milk, and salt. Spread potatoes over the meat mixture, then crosshatch the top with a fork. Bake until golden, 30 to 35 minutes.",
        "4": "https://www.epicurious.com/recipes/food/views/shepherds-pie-240224"
    },
    {
        "0": "Baked Rigatoni With Red Peppers and Green Olives",
        "1": "https://assets.epicurious.com/photos/61f8150ca2bbc00670179f64/1:1/w_2560%2Cc_limit/CacciatoreBakedPasta_RECIPE_IG_012322_26052_VOG_final.jpg",
        "2": "2 Tbsp. extra-virgin olive oil1 medium onion, finely chopped4 garlic cloves, thinly sliced1 (16-oz.) jar roasted red peppers, drained, finely chopped (about 1¾ cups)1 tsp. Diamond Crystal or ½ tsp. Morton kosher saltFreshly ground black pepper1 cup green olives, smashed, pits removed2 Tbsp. double-concentrated tomato paste¼ tsp. crushed red pepper flakes1 (14-oz.) can whole peeled tomatoes1 lb. rigatoni, penne, or zitiKosher salt4 Tbsp. unsalted butter2 tsp. finely chopped oregano2 oz. Parmesan, finely grated, divided1 lb. fresh mozzarella, torn into bite-size pieces, dividedHandful torn basil leaves (for serving)",
        "3": "Heat oil in a medium Dutch oven or other heavy pot over medium-high. Cook onion and garlic, stirring occasionally, until onion is slightly softened, about 4 minutes. Add roasted red peppers and salt; season with black pepper. Cook, stirring occasionally, until mixture is jammy, 8–10 minutes. Add olives, tomato paste, and red pepper flakes and cook, stirring often, until tomato paste is slightly darkened in color, about 3 minutes. Add tomatoes, crushing with your hands as you go, and their liquid and cook, stirring often, until slightly thickened, about 4 minutes.While sauce is cooking, place a rack in middle of oven; preheat to 350°. Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente (about 2 minute less than package directions; pasta will continue to cook in the oven). Drain pasta, reserving ⅓ cup pasta cooking liquid.Add pasta and reserved pasta cooking liquid to sauce. Reduce heat to medium and stir in butter, oregano, and half of Parmesan. Cook, stirring constantly, until sauce is thickened and glossy and coats pasta, about 2 minutes. Remove from heat and stir in half of mozzarella.Transfer pasta to a 13x9\" baking dish and spread into an even layer. Scatter remaining Parmesan and mozzarella over. Bake until bubbling around the edges, 15–20 minutes.Heat broiler. Broil pasta until top is brown and crisp in spots, about 3 minutes. Let cool 5 minutes, then top with basil for serving.",
        "4": "https://www.epicurious.com/recipes/food/views/baked-rigatoni-red-peppers-green-olives"
    }
]